// Напишите функцию, которая принимает одно число - высоту елочки 
// и рисует ее в консоли звездочками

int height = 5;
for (int i = 0; i < height; i++)
{	
	
	for (int j = 0; j <= i; j++)
		{
			while (j <= i)
			{
				
			}
			Console.Write("*");
		}	
		Console.WriteLine("");
}